#language: ru
Функционал: Корзина
  Сценарий: Добавление и удаление смартфонов из корзины
    Когда закрыта всплывающая реклама
    И закрыто сообщение про cookies
    И выполнен поиск товара '"iphone"'
    И выбрана цена до '"100000"'
    И выбрано значение оперативной памяти в "3" ГБ
    И выполнен клик по чекбоксу 'Высокий рейтинг'
    И в корзину добавлены первые восемь нечётных товаров
    И выполнен переход в корзину
    И выполнена проверка наличия выбранных товаров в корзине
    И выполнена проверка наличия в корзине "7" товаров


  Сценарий: Добавление и удаление беспроводных наушников из корзины
    Когда закрыта всплывающая реклама
    И закрыто сообщение про cookies
    И выполнен поиск товара '"беспроводные наушники"'
    И выбрана цена до '"10000"'
    И выполнен клик по чекбоксу 'Высокий рейтинг'

